tutorials/lagrangian/reactingParcelFoam/evaporationTest/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-05;
        relTol          0;
    }
    U
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0;
    }
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }
    G
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-05;
        relTol          0;
    }
    Yi
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }
    O2
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }
    N2
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }
    H2O
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }
    hs
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0;
    }
    k
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0;
    }
    epsilon
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0;
    }
}

PIMPLE
{
    transonic       no;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    momentumPredictor yes;
}

// ************************************************************************* //
